# Функція для додавання двох чисел
def add():
    a = int(input("Введіть перше число: "))  # Запит першого числа
    b = int(input("Введіть друге число: "))  # Запит другого числа
    print(f"Сума: {a + b}")  # Вивід результату додавання

# Функція для множення двох чисел
def mul():
    a = int(input("Введіть перше число: "))  # Запит першого числа
    b = int(input("Введіть друге число: "))  # Запит другого числа
    print(f"Добуток: {a * b}")  # Вивід результату множення

# Головна функція, яка визначає порядок виконання
def main():
    add()  # Перше додавання
    mul()  # Потім множення
    add()  # Знову додавання

# Точка входу в програму
if __name__ == '__main__':
    main()
